[notable_editing]
allow_urgency_override = 1
disabled = 0

[comment]
disabled = 0
is_required = 0

[incident_review]
disabled = 0
event_attributes = [{"label":"SourceProcessGuid","field":"SourceProcessGuid"},{"label":"SourceProcessId","field":"SourceProcessId"},{"label":"SourceImage","field":"SourceImage"},{"label":"TargetProcessGuid","field":"TargetProcessGuid"},{"label":"TargetProcessId","field":"TargetProcessId"},{"label":"TargetImage","field":"TargetImage"},{"field":"action","label":"Action"},{"field":"app","label":"Application"},{"field":"bytes_in","label":"Bytes In"},{"field":"bytes_out","label":"Bytes Out"},{"field":"category","label":"Category"},{"field":"change_type","label":"Change Type"},{"field":"channel","label":"Channel"},{"field":"command","label":"Command"},{"field":"cpu_load_percent","label":"CPU Load (%)"},{"field":"creator","label":"Creator"},{"field":"creator_realname","label":"Creator Realname"},{"field":"cve","label":"CVE"},{"field":"decoration","label":"Decoration"},{"field":"desc","label":"Description"},{"field":"dest","label":"Destination"},{"field":"dest_threatlist_category","label":"Destination Threat List Category"},{"field":"dest_threatlist_description","label":"Destination Threat List Description"},{"field":"dest_threatlist_name","label":"Destination Threat List Name"},{"field":"dest_bunit","label":"Destination Business Unit"},{"field":"dest_category","label":"Destination Category"},{"field":"dest_city","label":"Destination City"},{"field":"dest_country","label":"Destination Country"},{"field":"dest_dns","label":"Destination DNS"},{"field":"dest_ip","label":"Destination IP Address"},{"field":"dest_is_expected","label":"Destination Expected"},{"field":"dest_lat","label":"Destination Latitude"},{"field":"dest_long","label":"Destination Longitude"},{"field":"dest_mac","label":"Destination MAC Address"},{"field":"dest_nt_domain","label":"Destination NT Domain"},{"field":"dest_nt_host","label":"Destination NT Hostname"},{"field":"dest_owner","label":"Destination Owner"},{"field":"dest_pci_domain","label":"Destination PCI Domain"},{"field":"dest_port","label":"Destination Port"},{"field":"dest_record","label":"Destination Record"},{"field":"dest_should_timesync","label":"Destination Should Time Synchronize"},{"field":"dest_should_update","label":"Destination Should Update"},{"field":"dest_requires_av","label":"Destination Requires Antivirus"},{"field":"dest_translated_ip","label":"Destination Translated IP Address"},{"field":"dest_translated_port","label":"Destination Translated Port"},{"field":"dest_zone","label":"Destination Zone"},{"field":"dhcp_pool","label":"DHCP Pool"},{"field":"direction","label":"Direction"},{"field":"dns","label":"DNS"},{"field":"duration","label":"Duration"},{"field":"dvc","label":"Device"},{"field":"dvc_bunit","label":"Device Business Unit"},{"field":"dvc_category","label":"Device Category"},{"field":"dvc_city","label":"Device City"},{"field":"dvc_country","label":"Device Country"},{"field":"dvc_dns","label":"Device DNS"},{"field":"dvc_ip","label":"Device IP Address"},{"field":"dvc_is_expected","label":"Device Expected"},{"field":"dvc_lat","label":"Device Latitude"},{"field":"dvc_long","label":"Device Longitude"},{"field":"dvc_mac","label":"Device MAC Address"},{"field":"dvc_nt_host","label":"Device NT Hostname"},{"field":"dvc_owner","label":"Device Owner"},{"field":"dvc_pci_domain","label":"Device PCI Domain"},{"field":"dvc_should_timesync","label":"Device Should Time Synchronize"},{"field":"dvc_should_update","label":"Device Should Update"},{"field":"dvc_requires_av","label":"Device Requires Antivirus"},{"field":"end_time","label":"End Time"},{"field":"file_access_time","label":"File Access Time"},{"field":"file_create_time","label":"File Creation Time"},{"field":"file_hash","label":"File Hash"},{"field":"file_modify_time","label":"File Modify Time"},{"field":"file_name","label":"File Name"},{"field":"file_path","label":"File Path"},{"field":"file_permission","label":"File Permission"},{"field":"file_size","label":"File Size"},{"field":"FreeMBytes","label":"Free Megabytes"},{"field":"gap","label":"Gap"},{"field":"gid","label":"GID"},{"field":"hash","label":"Hash"},{"field":"http_content_type","label":"HTTP Content Type"},{"field":"http_method","label":"HTTP Method"},{"field":"http_referrer","label":"HTTP Referrer"},{"field":"http_user_agent","label":"HTTP User Agent"},{"field":"ids_type","label":"Intrusion Detection Type"},{"field":"iin_issuer","label":"Issuer Identification Number (IIN)"},{"field":"ip","label":"IP Address"},{"field":"ip_version","label":"Internet Protocol Version"},{"field":"is_interactive","label":"Interactive"},{"field":"is_lockout","label":"Is Lockout"},{"field":"is_privileged","label":"Is Privileged"},{"field":"isdir","label":"Is Directory"},{"field":"length","label":"Length"},{"field":"location","label":"Location"},{"field":"log_level","label":"Log Level"},{"field":"mac","label":"MAC Address"},{"field":"mem","label":"Total Memory"},{"field":"mem_committed","label":"Committed Memory"},{"field":"mem_free","label":"Free Memory"},{"field":"mem_used","label":"Used Memory"},{"field":"mode","label":"Mode"},{"field":"modtime","label":"Modification Time"},{"field":"modify_time","label":"Modification Time"},{"field":"mount","label":"Mount"},{"field":"name","label":"Name"},{"field":"note","label":"Note"},{"field":"nt_host","label":"NT Hostname"},{"field":"object_handle","label":"Object Handle"},{"field":"object_name","label":"Object Name"},{"field":"object_type","label":"Object Type"},{"field":"orig_host","label":"Host"},{"field":"orig_host_bunit","label":"Host Business Unit"},{"field":"orig_host_category","label":"Host Category"},{"field":"orig_host_city","label":"Host City"},{"field":"orig_host_country","label":"Host Country"},{"field":"orig_host_dns","label":"Host DNS"},{"field":"orig_host_ip","label":"Host IP Address"},{"field":"orig_host_is_expected","label":"Host Expected"},{"field":"orig_host_lat","label":"Host Latitude"},{"field":"orig_host_long","label":"Host Longitude"},{"field":"orig_host_mac","label":"Host MAC Address"},{"field":"orig_host_nt_host","label":"Host NT Hostname"},{"field":"orig_host_owner","label":"Host Owner"},{"field":"orig_host_pci_domain","label":"Host PCI Domain"},{"field":"orig_host_should_timesync","label":"Host Should Time Synchronize"},{"field":"orig_host_should_update","label":"Host Should Update"},{"field":"orig_host_requires_av","label":"Host Requires Av"},{"field":"os","label":"Operating System"},{"field":"os_name","label":"Operating System Name"},{"field":"os_release","label":"Operating System Release"},{"field":"outbound_interface","label":"Outbound Interface"},{"field":"package","label":"Package"},{"field":"package_title","label":"Package Title"},{"field":"packets_in","label":"Packets In"},{"field":"packets_out","label":"Packets Out"},{"field":"path","label":"Path"},{"field":"PercentFreeSpace","label":"Free Space (%)"},{"field":"PercentProcessorTime","label":"Processor Time (%)"},{"field":"pid","label":"Process Identifier"},{"field":"pii","label":"Personally Identifiable Information (PII)"},{"field":"port","label":"Port"},{"field":"process","label":"Process"},{"field":"product","label":"Product"},{"field":"product_version","label":"Product Version"},{"field":"proto","label":"Internet Protocol"},{"field":"reason","label":"Reason"},{"field":"recipient","label":"Recipient"},{"field":"record_class","label":"Record Class"},{"field":"record_type","label":"Record Type"},{"field":"result","label":"Result"},{"field":"rule_number","label":"Rule Identifier"},{"field":"selinux","label":"SELinux"},{"field":"selinuxtype","label":"SELinux Type"},{"field":"sender","label":"Sender"},{"field":"session_id","label":"Session Identifier"},{"field":"setlocaldefs","label":"Set Local Definitions"},{"field":"severity_id","label":"Severity Identifier "},{"field":"signature","label":"Signature"},{"field":"signature_id","label":"Signature Identifier"},{"field":"signature_version","label":"Signature Version"},{"field":"size","label":"Size"},{"field":"src","label":"Source"},{"field":"src_threatlist_category","label":"Source Threat List Category"},{"field":"src_threatlist_description","label":"Source Threat List Description"},{"field":"src_threatlist_name","label":"Source Threat List Name"},{"field":"src_bunit","label":"Source Business Unit"},{"field":"src_category","label":"Source Category"},{"field":"src_city","label":"Source City"},{"field":"src_country","label":"Source Country"},{"field":"src_dns","label":"Source DNS"},{"field":"src_ip","label":"Source IP Address"},{"field":"src_is_expected","label":"Source Expected"},{"field":"src_lat","label":"Source Latitude"},{"field":"src_long","label":"Source Longitude"},{"field":"src_mac","label":"Source MAC Address"},{"field":"src_nt_domain","label":"Source NT Domain"},{"field":"src_nt_host","label":"Source NT Hostname"},{"field":"src_owner","label":"Source Owner"},{"field":"src_pci_domain","label":"Source PCI Domain"},{"field":"src_port","label":"Source Port"},{"field":"src_record","label":"Source Record"},{"field":"src_should_timesync","label":"Source Should Time Synchronize"},{"field":"src_should_update","label":"Source Should Update"},{"field":"src_requires_av","label":"Source Requires Antivirus"},{"field":"src_translated_ip","label":"Source Translated IP Address"},{"field":"src_translated_port","label":"Source Translated Port"},{"field":"src_user","label":"Source User"},{"field":"src_user_bunit","label":"Source User Business Unit"},{"field":"src_user_category","label":"Source User Category"},{"field":"src_user_email","label":"Source User Email"},{"field":"src_user_enddate","label":"Source User End Date"},{"field":"src_user_identity","label":"Source User Identity"},{"field":"src_user_first","label":"Source User First Name"},{"field":"src_user_last","label":"Source User Last Name"},{"field":"src_user_group","label":"Source User Group"},{"field":"src_user_group_id","label":"Source User Group Identifier"},{"field":"src_user_id","label":"Source User Identifier"},{"field":"src_user_privilege","label":"Source User Privilege"},{"field":"src_user_work_city","label":"Source User Work City"},{"field":"src_zone","label":"Source Zone"},{"field":"sshd_protocol","label":"SSHD Protocol"},{"field":"ssid","label":"Service Set Identifier (SSID)"},{"field":"storage","label":"Total Storage"},{"field":"storage_free","label":"Free Storage"},{"field":"storage_free_percent","label":"Free Storage (%)"},{"field":"storage_used","label":"Used Storage"},{"field":"storage_used_percent","label":"Used Storage (%)"},{"field":"start_mode","label":"Start Mode"},{"field":"start_time","label":"Start Time"},{"field":"StartMode","label":"Start Mode"},{"field":"subject","label":"Subject"},{"field":"syslog_facility","label":"Syslog Facility"},{"field":"syslog_priority","label":"Syslog Priority"},{"field":"SystemUpTime","label":"System Uptime"},{"field":"tcp_flags","label":"TCP Flags"},{"field":"threat_ip","label":"Threat IP"},{"field":"tos","label":"Type Of Service"},{"field":"TotalMBytes","label":"Total Megabytes"},{"field":"transaction_id","label":"Transaction Identifier"},{"field":"transport","label":"Transport Protocol"},{"field":"ttl","label":"Time To Live"},{"field":"uid","label":"UID"},{"field":"uptime","label":"Uptime"},{"field":"url","label":"URL"},{"field":"UsedMBytes","label":"Used Megabytes"},{"field":"user","label":"User"},{"field":"user_bunit","label":"User Business Unit"},{"field":"user_category","label":"User Category"},{"field":"user_email","label":"User Email"},{"field":"user_enddate","label":"User End Date"},{"field":"user_identity","label":"User Identity"},{"field":"user_first","label":"User First Name"},{"field":"user_last","label":"User Last Name"},{"field":"user_group","label":"User Group"},{"field":"user_group_id","label":"User Group Identifier"},{"field":"user_id","label":"User Identifier"},{"field":"user_privilege","label":"User Privilege"},{"field":"user_work_city","label":"User Work City"},{"field":"validity","label":"Validity"},{"field":"vendor","label":"Vendor"},{"field":"vendor_product","label":"Vendor/Product"},{"field":"view","label":"View"},{"field":"vlan_id","label":"VLAN Identifier"},{"field":"vlan_name","label":"VLAN Name"},{"field":"threat_category","label":"Threat Category"},{"field":"threat_collection","label":"Threat Collection"},{"field":"threat_collection_key","label":"Threat Collection Key"},{"field":"threat_description","label":"Threat Description"},{"field":"threat_group","label":"Threat Group"},{"field":"threat_key","label":"Threat Key"},{"field":"threat_match_field","label":"Threat Match Field"},{"field":"threat_match_value","label":"Threat Match Value"},{"field":"threat_source_id","label":"Threat Source ID"},{"field":"threat_source_path","label":"Threat Source Path"},{"field":"threat_source_status","label":"Threat Source Status"},{"field":"threat_source_type","label":"Threat Source Type"},{"field":"malware_alias","label":"Malware Alias"}]
